An element may not reference an element in another Option of the same Option Set.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BadReferenceBetweenOptions { get; }
  Visual Basic
Public Shared ReadOnly Property BadReferenceBetweenOptions As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BadReferenceBetweenOptions {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DesignOptionFailures Class
  Autodesk.Revit.DB Namespace